1. Разработать класс Matrix, имеющий следующие поля:
- int** matrix
- Width - длина массива
- Height - высота массива

Методы:
- конструкторы (без параметров, копирования, с размерами)
- деструктор
- void Print() - печать массива
- void Set(x, y, value) - сеттер значения
- int Get(x, y) - геттер значения
- int Min()
- bool Save(char* filename)
- bool Load(char* filename)

Операторы:
- operator(x, y) - чтение значения по координатам (геттер)
- operator== - сравнение с Matrix
- operator!=
- operator>= - сравнение по сумме элементов
- operator<= - сравнение по сумме элементов
- Rotate90() - метод, который поворачивает матрицу на 90 градусов

пример:
1 2 3 		1 4
4 5 6 =>    2 5
			3 6

Пример:

Matrix matrix(4, 5);
matrix.Set(3, 4, 23);
cout << matrix(1, 2) << endl;

matrix.Save("file.dat");
matrix.Load("file.dat");

2. Написать программу, которая выводит на экран свой исходный код. (+1 балл)