1. Разработать класс MyString, имеющий следующие поля:
- char* Str (указатель на строку)
- MaxSize - (максимальный размер строки)

методы класса
- контструкторы (по умолчанию, или принимает С-строку, конструктор копирования)
- деструктор
- void Print() - печать строки
- Set("test") - изменение строки в классе

- char* Get() - возвращает строку из класса
- int GetLength() - получить текущий размер строки
- int GetVowelsCount() - получить количество гласных
- void ToUpper() - перевести строку в верхний регистр
- void ToLower() - перевести строку в нижний регистр
- void RemoveDigits() - удаляет все цифры из строки

Пример:
MyString str("Hello world!!!!");
str.Print();

char* tst = str.Get();
cout << strlen(tst) << endl;

int len = str.GetLength();

2. Написать программу, которая выводит на экран свой исходный код. (+1 балл)